Revit 2027 API
BuiltInFailures.GeneralFailures.GenericWarning Property
 A generic error has occurred.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GenericWarning { get; }
Public Shared ReadOnly Property GenericWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GenericWarning {
	FailureDefinitionId^ get ();
}
static member GenericWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace